#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
random_id.this: Refreshing state... [id=iffGV4KS-ho]
module.compute.tls_private_key.ssh: Refreshing state... [id=0a9aa76c877d113f4d4ba05fdcaf2567f8e82605]
module.compute.local_file.private_key: Refreshing state... [id=c5932a1b953f48c9c88d335adec239ac3b63f492]
data.aws_caller_identity.current: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::890742591881:oidc-provider/token.actions.githubusercontent.com]
module.compute.aws_key_pair.main: Refreshing state... [id=rss-key]
module.compute.data.aws_ami.amazon_linux: Reading...
data.aws_region.current: Reading...
module.networking.data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-00546a76c2314dc2e]
aws_s3_bucket.terraform_state: Refreshing state... [id=rss-devops-terraform-state]
module.test_bucket.aws_s3_bucket.this: Refreshing state... [id=test-bucket-89f7c6578292fa1a]
data.aws_region.current: Read complete after 0s [id=eu-north-1]
data.aws_caller_identity.current: Read complete after 1s [id=890742591881]
aws_iam_role.github_actions: Refreshing state... [id=GithubActionsRole]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/IAMFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707057500000005]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707059100000006]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonVPCFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706652800000002]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707303800000007]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706647800000001]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonS3FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706850400000003]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonSQSFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706852400000004]
module.networking.data.aws_availability_zones.available: Read complete after 1s [id=eu-north-1]
module.compute.data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0da6daf5e3e5ea2a8]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0bbb03c7f2fda61e7]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0871a6dc1411680d6]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-03f3494151159f16c]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-03f20320a4be70b78]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0b1499e2b8356dfbd]
module.security.aws_security_group.nat: Refreshing state... [id=sg-0f2406cfba215c1c6]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-0fe08a1b00ac33228]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0cef2c388e2bcc4e7]
module.security.aws_security_group.public: Refreshing state... [id=sg-07659f0854c543a3a]
module.networking.aws_default_route_table.public: Refreshing state... [id=rtb-07a74d7f91fc46315]
module.security.aws_security_group.k3s: Refreshing state... [id=sg-06bf0633ae7b0dd01]
aws_s3_bucket_versioning.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_object_lock_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
module.test_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=test-bucket-89f7c6578292fa1a]
module.security.aws_network_acl.private: Refreshing state... [id=acl-0ebf3d5a55c2bfd00]
module.security.aws_security_group.private: Refreshing state... [id=sg-0ddda8e01cc267784]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04f3b8f4a663a5a13]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09bac081289b00d9a]
module.compute.aws_instance.nat: Refreshing state... [id=i-0ad97990bd3a88059]
module.compute.aws_instance.bastion: Refreshing state... [id=i-08d21d33269f95798]
module.security.aws_network_acl.public: Refreshing state... [id=acl-0d10acf5dbca983a0]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e2cbf50670b2eb67]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e8df59675d74e416]
aws_route.private_nat: Refreshing state... [id=r-rtb-0b1499e2b8356dfbd1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "modules/compute/keys/rss-key.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>